I'm not sure it is related, but I'm also using lambda module and I also have end up with a CloudWatch log group with a different name from what is set by the lamdba module.
 
If I use this module alone I can't set the log group name to something in PascalCase, something somewhere is setting the name to `lower`, as if `label_value_case` was set to `lower` by default.. actually, it is stated into `context.tf` that the default is `lower`, but then `default` is actually set to `null` in there, so I really don't know from where that `lower` is coming from.

Anyway if I set the name like this:
```
name              = "infra-alerts-CamelCase"
```

I get this:
```
[...]
  + resource "aws_cloudwatch_log_group" "default" {
  + arn               = (known after apply)                                                                                                                                                                      
  + id                = (known after apply)
  + log_group_class   = (known after apply)                                                                                                                                                                      
  + name              = "/aws/lambda/infra-mgmt-ssolastlogintracking" <--------- lowercase
```

Like I said if I want that name to be CamelCase I need to force `label_value_case = "null"`, and I get what I want but, if I use lambda, I cannot set `label_value_case` (I tried and it's not passed to the submobdule apparently) so I eventually get the cloudwatch name different from the function name, which leads exactly to the same issue as above.
